import { MediaItem } from '../types';

export const INITIAL_MEDIA_ITEMS: MediaItem[] = [
  {
    "id": "item-1791628634324",
    "views": 2,
    "title": "الخليفة",
    "synopsis": "سرحات، الجراح الناجح الذي فرّ من قدره في أورفا ليعيش حياة جديدة في إسطنبول مع زوجته ملك، يُجبر على العودة إلى قريته لتسلم منصب الآغا والزواج من يلدز لإنهاء عداوة طويلة بين العائلات. ومع وصول ملك إلى القصر، يجد نفسه محاصرًا بين الحب والواجب، بينما تبدأ أسرار الماضي الدفينة بالظهور شيئًا فشيئًا لتقلب حياته رأسًا على عقب.",
    "backdropUrl": "https://i.postimg.cc/pXXGjs4s/IMG-960d6e3a-033a-46b1-99ad-207d38aa9dc9.jpg",
    "posterUrl": "https://i.postimg.cc/pXXGjs4s/IMG-960d6e3a-033a-46b1-99ad-207d38aa9dc9.jpg",
    "releaseYear": 2025,
    "createdAt": "2026-10-10",
    "isFeatured": false,
    "originalTitle": "Halef",
    "genres": [
      "دراما",
      "رومانسية"
    ],
    "isMiflixOriginal": false,
    "type": "series",
    "seasons": [
      {
        "episodes": [
          {
            "servers": [
              {
                "url": "",
                "id": "s1-1791628609788",
                "type": "embed",
                "name": "سيرفر VIP"
              }
            ],
            "episodeNumber": 39,
            "title": "الحلقة 39",
            "id": "ep-1791628609788-39"
          }
        ],
        "seasonNumber": 2,
        "title": "الموسم الثاني",
        "id": "season-1791628583339"
      }
    ],
    "categoryId": "turkish_drama",
    "keywords": [
      "مسلسل الخليفة الحلقة",
      "مشاهدة مسلسل الخليفة الحلقة  مترجمة كاملة",
      "تحميل مسلسل الخليفة الحلقة  1080p",
      "الخليفة الحلقة  قصة عشق",
      "الخليفة حلقة 1 ايجي بست",
      "الخليفة حلقة ماي سيما",
      "الخليفة الحلقة  بدون إعلانات",
      "الحلقة  الخليفة",
      "قصة عشق الخليفة",
      "كامل ومترجم الخليفة",
      "بدون إعلانات مزعجة الخليفة",
      "مدبلج للعربية الخليفة"
    ]
  },
  {
    "id": "item-1791629115011",
    "type": "series",
    "title": "المدينة البعيدة",
    "isFeatured": false,
    "views": 1,
    "seasons": [
      {
        "title": "الموسم الثاني",
        "episodes": [
          {
            "servers": [
              {
                "id": "s1-1791629102200",
                "url": "",
                "type": "embed",
                "name": "سيرفر VIP"
              }
            ],
            "title": "الحلقة 68",
            "episodeNumber": 68,
            "id": "ep-1791629102200-68"
          }
        ],
        "id": "season-1791629058301",
        "seasonNumber": 2
      }
    ],
    "originalTitle": "Uzak Şehir",
    "synopsis": "تأتي أليا ألبورا من كندا إلى ماردين مع ابنها ذي الخمس سنوات وجثمان زوجها لتنفيذ وصيته، لكنها تجد نفسها محاصرة في أراضي عائلة ألبورا دون إمكانية المغادرة. تواجه أليا صراعات مع عائلة زوجها وسط النزاعات العشائرية والتعصب الإقطاعي، محاولةً كشف أسرار الماضي وإنقاذ ابنها في الوقت نفسه.",
    "isMiflixOriginal": false,
    "categoryId": "turkish_drama",
    "posterUrl": "https://i.postimg.cc/W3y37WSy/IMG-74122b43-af87-46c3-8124-38932eadab3a.jpg",
    "releaseYear": 2024,
    "keywords": [
      "مسلسل المدينة البعيدة الموسم الثاني",
      "مشاهدة مسلسل المدينة البعيدة الحلقة الموسم الثاني مترجمة كاملة",
      "تحميل مسلسل المدينة البعيدة الحلقة الموسم الثاني 1080p",
      "المدينة البعيدة الحلقة الموسم الثاني قصة عشق",
      "المدينة البعيدة حلقة الموسم الثاني ايجي بست",
      "المدينة البعيدة حلقة الموسم الثانيماي سيما",
      "المدينة البعيدة الحلقة النوسم الثاني بدون إعلانات",
      "الحلقة الموسم الثاني  المدينة البعيدة",
      "كامل ومترجم المدينة البعيدة",
      "قصة عشق المدينة البعيدة",
      "مدبلج للعربية المدينة البعيدة",
      "بدون إعلانات مزعجة المدينة البعيدة"
    ],
    "genres": [
      "دراما",
      "جريمة",
      "وأكشن"
    ],
    "backdropUrl": "https://i.postimg.cc/W3y37WSy/IMG-74122b43-af87-46c3-8124-38932eadab3a.jpg",
    "createdAt": "2026-10-10"
  },
  {
    "id": "item-1791629572453",
    "createdAt": "2026-10-10",
    "title": "تحت الأرض",
    "keywords": [
      "مسلسل تحت الارض الموسم الثاني قصة عشق",
      "قصة عشق تتحت الارض الموسم الثاني",
      "مسلسل تحت الأرض الحلقة الموسم الثاني",
      "مشاهدة مسلسل تحت الأرض الحلقة 1 مترجمة كاملة",
      "تحميل مسلسل تحت الأرض الحلقة الموسم الثاني1080p",
      "تحت الأرض الحلقة الموسم الثاني قصة عشق",
      "تحت الأرض حلقة الموسم الثاني ايجي بست",
      "تحت الأرض حلقة الموسم الثاني ماي سيما",
      "تحت الأرض الحلقة الموسم الثاني بدون إعلانات",
      "الحلقة الموسم الثاني تحت الأرض",
      "قصة عشق تحت الأرض",
      "كامل ومترجم تحت الأرض",
      "مدبلج للعربية تحت الأرض"
    ],
    "views": 0,
    "releaseYear": 2026,
    "originalTitle": "Yeraltı",
    "seasons": [
      {
        "id": "season-1791629556939",
        "episodes": [
          {
            "episodeNumber": 18,
            "title": "الحلقة 18",
            "servers": [
              {
                "type": "embed",
                "name": "سيرفر VIP",
                "url": "",
                "id": "s1-1791629561614"
              }
            ],
            "id": "ep-1791629561614-18"
          }
        ],
        "title": "الموسم الثاني",
        "seasonNumber": 2
      }
    ],
    "categoryId": "turkish_drama",
    "backdropUrl": "https://i.postimg.cc/g2fbN9bQ/IMG-5af8cd33-9f3f-4aa6-b167-0a689a8fb88c.jpg",
    "posterUrl": "https://i.postimg.cc/g2fbN9bQ/IMG-5af8cd33-9f3f-4aa6-b167-0a689a8fb88c.jpg",
    "type": "series",
    "genres": [
      "دراما",
      "أكشن",
      "وجريمة"
    ],
    "isMiflixOriginal": false,
    "synopsis": "يندفع شاب تحركه نار الثار إلى الاقتصاص ممن أبادوا عائلته، فيرتكب جريمة تغيّر مسار حياته بالكامل. يقوده انتقامه إلى السجن، حيث يجد نفسه محاطًا بإحدى أخطر شبكات الجريمة المنظمة في تركيا. بعد ثلاث سنوات، يخرج ليواجه حقيقة أقسى من السجن نفسه: المرأة التي ما زال قلبه متعلقًا بها أصبحت زوجة أقرب الناس إليه.",
    "isFeatured": false
  },
  {
    "id": "item-1791630094801",
    "synopsis": "بعد 7 سنوات من اختفاء ليلي الغامض يوم زفافهما، يجدها ميرزا صدفة في سوريا أثناء إنقاذ ابن أخته المخطوف. يدخل في مغامرة خطيرة لتهريبها إلى كابادوكيا، ليشتعل حبّهما القديم مجدداً وسط أسرار عائلية وصراعات مصيرية.",
    "createdAt": "2026-10-10",
    "backdropUrl": "https://i.postimg.cc/YSsR1kcY/IMG-5f058b49-f02e-448d-b38b-706ff787c7f9.jpg",
    "posterUrl": "https://i.postimg.cc/YSsR1kcY/IMG-5f058b49-f02e-448d-b38b-706ff787c7f9.jpg",
    "title": "حبك نار",
    "releaseYear": 2026,
    "views": 0,
    "isMiflixOriginal": false,
    "categoryId": "turkish_drama",
    "type": "series",
    "genres": [
      "دراما",
      "ورومانسية (مع طابع من الغموض والأسرار العائلية)"
    ],
    "seasons": [
      {
        "id": "s-1",
        "seasonNumber": 1,
        "title": "الموسم الأول",
        "episodes": [
          {
            "id": "ep-1791630089829-6",
            "episodeNumber": 6,
            "title": "الحلقة 6",
            "servers": [
              {
                "url": "",
                "name": "سيرفر VIP",
                "type": "embed",
                "id": "s1-1791630089829"
              }
            ]
          }
        ]
      }
    ],
    "isFeatured": false,
    "keywords": [
      "مسلسل حبك نار قصة عشق",
      "قصة عشق حبك نار",
      "مسلسل حبك نار الحلقة 1",
      "مشاهدة مسلسل حبك نار الحلقة 1 مترجمة كاملة",
      "تحميل مسلسل حبك نار الحلقة 1 1080p",
      "حبك نار الحلقة 1 قصة عشق",
      "حبك نار حلقة 1 ايجي بست",
      "حبك نار حلقة 1 ماي سيما",
      "حبك نار الحلقة 1 بدون إعلانات",
      "الحلقة 1 حبك نار",
      "مشاهدة وتحميل حبك نار",
      "كامل ومترجم حبك نار",
      "ايجي بست حبك نار",
      "بجودة 1080p FHD حبك نار",
      "قصة عشق حبك نار"
    ],
    "originalTitle": "Sevdan Bir Ateş"
  },
  {
    "id": "item-1791630550816",
    "title": "هذا البحر سوف يفيض",
    "views": 0,
    "isFeatured": false,
    "type": "series",
    "keywords": [
      "مسلسل هذا البحر سوف يفيض الموسم الثاني قصة عشق",
      "مسلسل هذا البحر سوف يفيض الموسم الاول قصة عشق",
      "قصة عشق هذا البحر سوف يفيض",
      "مسلسل هذا البحر سوف يفيض الحلقة الموسم الثاني",
      "مشاهدة مسلسل هذا البحر سوف يفيض الحلقة الموسم الاول و الثاني مترجمة كاملة",
      "تحميل مسلسل هذا البحر سوف يفيض الحلقة الموسم الثاني 1080p",
      "هذا البحر سوف يفيض الحلقة الموسم الثانيقصة عشق",
      "هذا البحر سوف يفيض حلقة الموسم الثاني ايجي بست",
      "هذا البحر سوف يفيض حلقة 1 ماي سيما",
      "هذا البحر سوف يفيض الحلقة 1 بدون إعلانات",
      "الحلقة 1 هذا البحر سوف يفيض"
    ],
    "createdAt": "2026-10-10",
    "categoryId": "turkish_drama",
    "synopsis": "تشتعل الأحداث بصراع طويل الأمد بين عائلة مُرتونا وعائلة كوتشاري، حيث تتحرك خيوطه بين الانتقام والطمع والحب والخيانة وتتعقد الأمور بعد ظهور شخصية إيليني، الفتاة القادمة من أثينا للبحث عن جذورها، والتي تفتح أبوابًا ماضية مغلقة. كما أن خروج \"شريف\" زوج إسمي من السجن يشعل التوتر ويقلب موازين القوى.",
    "backdropUrl": "https://i.postimg.cc/W1McWWp0/IMG-38a32356-e02d-46e8-9fa4-0c07bcfb1d53.jpg",
    "originalTitle": "Taşacak Bu Deniz",
    "genres": [
      "دراما",
      "تشويق"
    ],
    "releaseYear": 2025,
    "isMiflixOriginal": false,
    "seasons": [
      {
        "title": "الموسم الثاني",
        "id": "season-1791630538542",
        "episodes": [
          {
            "title": "الحلقة 34",
            "id": "ep-1791630546887-34",
            "episodeNumber": 34,
            "servers": [
              {
                "id": "s1-1791630546887",
                "url": "",
                "name": "سيرفر VIP",
                "type": "embed"
              }
            ]
          }
        ],
        "seasonNumber": 2
      }
    ],
    "posterUrl": "https://i.postimg.cc/W1McWWp0/IMG-38a32356-e02d-46e8-9fa4-0c07bcfb1d53.jpg"
  },
  {
    "id": "item-1791630992250",
    "genres": [
      "كوميدي",
      "رومانسي",
      "ودراما اجتماعية"
    ],
    "backdropUrl": "https://i.postimg.cc/hGzyZh1r/IMG-2aaa581f-abef-4b11-9d06-3512e8b1dc61.jpg",
    "isFeatured": false,
    "synopsis": "تدور الأحداث حول شخصية \"دفنه\" التي تجاوزت الثلاثين من عمرها، وشقت طريقها في الحياة المهنية بعصامية وقوة لتعتمد على نفسها. ورغم نجاح شعورها بالقوة والاستقرار، تدرك كم هي متعبة وتحتاج للحب، لتجد نفسها ولأول مرة تقع في الحب عندما يعترض طريقها رجلان يقلبان حياتها رأساً على عقب.",
    "releaseYear": 2026,
    "originalTitle": "Muhtemel Aşk",
    "title": "حب محتمل",
    "views": 0,
    "createdAt": "2026-10-10",
    "keywords": [
      "حب محتمل الحلقة 18 قصة عشق",
      "قصة عشق حب محتمل",
      "حب محتمل قصة عشق مترجم",
      "مسلسل حب محتمل قصة عشق",
      "مسلسل حب محتمل الحلقة 1",
      "مشاهدة مسلسل حب محتمل الحلقة 1 مترجمة كاملة",
      "تحميل مسلسل حب محتمل الحلقة 1 1080p",
      "حب محتمل الحلقة 1 قصة عشق",
      "حب محتمل حلقة 1 ايجي بست",
      "حب محتمل حلقة 1 ماي سيما",
      "حب محتمل الحلقة 1 بدون إعلانات",
      "الحلقة 1 حب محتمل",
      "كامل ومترجم حب محتمل",
      "بدون إعلانات مزعجة حب محتمل",
      "مدبلج للعربية حب محتمل"
    ],
    "categoryId": "turkish_drama",
    "type": "series",
    "isMiflixOriginal": false,
    "posterUrl": "https://i.postimg.cc/hGzyZh1r/IMG-2aaa581f-abef-4b11-9d06-3512e8b1dc61.jpg",
    "seasons": [
      {
        "title": "الموسم الأول",
        "seasonNumber": 1,
        "id": "s-1",
        "episodes": [
          {
            "servers": [
              {
                "url": "",
                "id": "s1-1791630981642",
                "type": "embed",
                "name": "سيرفر VIP"
              }
            ],
            "id": "ep-1791630981642-18",
            "episodeNumber": 18,
            "title": "الحلقة 18"
          }
        ]
      }
    ]
  },
  {
    "id": "item-1791631603059",
    "backdropUrl": "https://i.postimg.cc/NMGyf2PY/images.jpg",
    "isMiflixOriginal": false,
    "createdAt": "2026-10-10",
    "genres": [
      "دراما",
      "تشويق"
    ],
    "isFeatured": false,
    "keywords": [
      "مسلسل ورود وذنوب قصة عشم الموسم الثاني و الاول",
      "قصة عشق ورود وذنوب الموسم الثاني و الاول",
      "قصة عشق ورود وذنوبمسلسل ورود وذنوب الحلقة الموسم الثاني",
      "مشاهدة مسلسل ورود وذنوب الحلقة الموسم الثاني مترجمة كاملة",
      "تحميل مسلسل ورود وذنوب الحلقة الموسم الثاني 1080p",
      "ورود وذنوب الحلقة 1 قصة عشق",
      "ورود وذنوب حلقة الموسم الثاني ايجي بست",
      "ورود وذنوب حلقة 1 ماي سيما",
      "ورود وذنوب الحلقة الموسم الثاني بدون إعلانات",
      "الحلقة الموسم الثاني ورود وذنوب"
    ],
    "releaseYear": 2025,
    "originalTitle": "Güller ve Günahlar",
    "posterUrl": "https://i.postimg.cc/NMGyf2PY/images.jpg",
    "synopsis": "تتناول قصة رجل الأعمال الناجح \"سرحات\" الذي بُني عالمه على الصصدق والثقة، حتى يكتشف أن زوجته \"بيراك\" كانت تخفي عنه سرًا كبيرًا لسنوات. وقبل أن يواجهها، تتعرض لحادث مأساوي يدخلها في غيبوبة طويلة، تاركة خلفها أسرارًا تهدد تماسك الأسرة. وفي أثناء محاولة سرحات ترتيب حياته المنهارة، تقتحم عالمه \"زينب\"، وهي شابة جريئة وصريحة من حي فقير.",
    "categoryId": "turkish_drama",
    "type": "series",
    "views": 0,
    "title": "ورود وذنوب",
    "seasons": [
      {
        "title": "الموسم الثاني",
        "id": "season-1791631570238",
        "episodes": [
          {
            "title": "الحلقة 38",
            "id": "ep-1791631600803-38",
            "servers": [
              {
                "id": "s1-1791631600803",
                "name": "سيرفر VIP",
                "type": "embed",
                "url": ""
              }
            ],
            "episodeNumber": 38
          }
        ],
        "seasonNumber": 2
      }
    ]
  }
];
